In [58]:
import pandas as pd

In [59]:
df = pd.read_csv('/home/prashant/Desktop/practice/practice_1.csv')

In [60]:
df.head(5)

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357,Andrew,Banks,AB4318@gmail.com,boots,leather,brown

In [61]:
df[(df.shoe_type == 'clogs') & (df.shoe_color == 'brown')]

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
8,21586,Gabriel,Porter,GabrielPorter24@gmail.com,clogs,leather,brown

In [62]:
df[(df.first_name =='Emily') & (df.last_name == 'Joyce')]

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
1,53450,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy

In [63]:
df1 = pd.DataFrame({
    'product Id': [1,2,3,4,5,6,7,8,9],
    'name': ['pr','aas','we','rt','ty','yu','ui','io','po'],
})
print(df1)

  name  product Id
0   pr           1
1  aas           2
2   we           3
3   rt           4
4   ty           5
5   yu           6
6   ui           7
7   io           8
8   po           9

In [64]:
df2 =pd.DataFrame({
    'name':['par', 'rad', 'sum','poi','ram'],
    'number':[1,2,3,4,5],
    'Color': ['blue', 'green', 'red', 'black','orange']
})
print(df2)

    Color name  number
0    blue  par       1
1   green  rad       2
2     red  sum       3
3   black  poi       4
4  orange  ram       5

In [65]:
df3 = pd.DataFrame([
    [1,'prashant',12,'asade'],
    [2,'rah',23,'khu'],
    [3,'ckoa',23,'sakmdck']
],
    columns=[
        'sr.no','name','age','village'
    ],
    
)
print(df3)

   sr.no      name  age  village
0      1  prashant   12    asade
1      2       rah   23      khu
2      3      ckoa   23  sakmdck

In [66]:
df4 = pd.read_csv('/home/prashant/Desktop/practice/practice_1.csv')
print(df4)

      id first_name last_name                         email     shoe_type  \
0  54791    Rebecca   Lindsay  RebeccaLindsay57@hotmail.com         clogs
1  53450      Emily     Joyce        EmilyJoyce25@gmail.com  ballet flats
2  91987      Joyce    Waller        Joyce.Waller@gmail.com       sandals
3  14437     Justin  Erickson   Justin.Erickson@outlook.com         clogs
4  79357     Andrew     Banks              AB4318@gmail.com         boots
5  52386      Julie     Marsh        JulieMarsh59@gmail.com       sandals
6  20487     Thomas    Jensen              TJ5470@gmail.com         clogs
7  76971     Janice     Hicks        Janice.Hicks@gmail.com         clogs
8  21586    Gabriel    Porter     GabrielPorter24@gmail.com         clogs
9  62083    Frances    Palmer     FrancesPalmer50@gmail.com        wedges

  shoe_material shoe_color
0  faux-leather      black
1  faux-leather       navy
2        fabric      black
3  faux-leather        red
4       leather      brown
5        fabric      black
6        fabric       navy
7  faux-leather       navy
8       leather      brown
9       leather      white

In [67]:
df4.head()

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357,Andrew,Banks,AB4318@gmail.com,boots,leather,brown

In [68]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
id               10 non-null int64
first_name       10 non-null object
last_name        10 non-null object
email            10 non-null object
shoe_type        10 non-null object
shoe_material    10 non-null object
shoe_color       10 non-null object
dtypes: int64(1), object(6)
memory usage: 640.0+ bytes

In [69]:
df5 = pd.DataFrame([
    ['Rebecca Erikson','Thomas Roberson','Diane Ochoa'],
    [35,28,42]],
    
    columns= ['name', 'age','mark'])
age = df5.age
print(type(age))
print(df5)

<class 'pandas.core.series.Series'>
              name              age         mark
0  Rebecca Erikson  Thomas Roberson  Diane Ochoa
1               35               28           42

In [70]:
df5[['age','mark','name']]

               age         mark             name
0  Thomas Roberson  Diane Ochoa  Rebecca Erikson
1               28           42               35

In [71]:
ageName = df5[['age','name']]

In [72]:
print(type(ageName))

<class 'pandas.core.frame.DataFrame'>

In [73]:
ageName=df5.iloc(1)

In [74]:
ageName=df.iloc[1]

In [75]:
df5.iloc[1:3]

  name age mark
1   35  28   42

In [76]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
name    2 non-null object
age     2 non-null object
mark    2 non-null object
dtypes: object(3)
memory usage: 128.0+ bytes

In [77]:
df5[df5.age==35]

Empty DataFrame
Columns: [name, age, mark]
Index: []

In [78]:
df5[df5.age==40]

Empty DataFrame
Columns: [name, age, mark]
Index: []

In [79]:
df6 = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west'])

In [83]:
January = df6[df6.month == 'January']

In [84]:
print(January)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100

In [93]:
df =df6[(df6.month=='January')|(df6.clinic_east>100)]
print(df)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
5     June          112           109            79          129

In [88]:
January_feb_Mar = df6[df6.month.isin(['January','February','March'])]

In [89]:
print(January_feb_Mar)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100

In [94]:
print(df)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
5     June          112           109            79          129

In [95]:
print(df6)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
5     June          112           109            79          129

In [96]:
df7 = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west'])

In [97]:
print(df7)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [101]:
df7[df7.clinic_west == 100]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100